Revit 2027 API
ImageInstance.SetLocation Method
 Moves the ImageInstance to the specified location
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLocation(
	XYZ newLocation,
	BoxPlacement placementPoint
)
Public Sub SetLocation (
	newLocation As XYZ,
	placementPoint As BoxPlacement
)
public:
void SetLocation(
	XYZ^ newLocation,
	BoxPlacement placementPoint
)
member SetLocation :
        newLocation : XYZ *
        placementPoint : BoxPlacement -> unit
Parameters
newLocation XYZ
 The new location of the specified point
placementPoint BoxPlacement
 The placementPoint specifies which point of the ImageInstance should be placed at the given location.
Exceptions
Exception | Condition
ArgumentException |  The given newLocation is more than 10 miles from the origin of the model
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace